## Plan Result (482: Aks_test - DeployInfrastructure)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_resource_group.disks_resource_group
  * azurerm_role_assignment.disk
* Delete
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;msnode&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;msnode&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.disks_resource_group will be created
  + resource "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "disks-test-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
    }

  # azurerm_role_assignment.disk will be created
  + resource "azurerm_role_assignment" "disk" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b24bca5d-656e-4285-85a9-f69dd718a17e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["msnode"] will be destroyed
  # (because key ["msnode"] is not in for_each map)
  - resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - auto_scaling_enabled          = true -> null
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      - id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-test-00-aks/agentPools/msnode" -> null
      - kubelet_disk_type             = "OS" -> null
      - kubernetes_cluster_id         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-test-00-aks" -> null
      - max_count                     = 4 -> null
      - max_pods                      = 30 -> null
      - min_count                     = 2 -> null
      - mode                          = "User" -> null
      - name                          = "msnode" -> null
      - node_count                    = 2 -> null
      - node_labels                   = {} -> null
      - node_public_ip_enabled        = false -> null
      - node_taints                   = [
          - "kubernetes.io/os=windows:NoSchedule",
        ] -> null
      - orchestrator_version          = "1.32" -> null
      - os_disk_size_gb               = 128 -> null
      - os_disk_type                  = "Ephemeral" -> null
      - os_sku                        = "Windows2019" -> null
      - os_type                       = "Windows" -> null
      - priority                      = "Regular" -> null
      - scale_down_mode               = "Delete" -> null
      - spot_max_price                = -1 -> null
      - tags                          = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "testing"
        } -> null
      - ultra_ssd_enabled             = false -> null
      - vm_size                       = "Standard_D4ds_v5" -> null
      - vnet_subnet_id                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-00" -> null
      - zones                         = [
          - "1",
        ] -> null
        # (6 unchanged attributes hidden)

      - timeouts {
          - update = "180m" -> null
        }

      - upgrade_settings {
          - drain_timeout_in_minutes      = 0 -> null
          - max_surge                     = "33%" -> null
          - node_soak_duration_in_minutes = 0 -> null
        }

      - windows_profile {
          - outbound_nat_enabled = true -> null
        }
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["msnode"] will be destroyed
  # (because key ["msnode"] is not in for_each map)
  - resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - auto_scaling_enabled          = true -> null
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      - id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-test-01-aks/agentPools/msnode" -> null
      - kubelet_disk_type             = "OS" -> null
      - kubernetes_cluster_id         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-test-01-aks" -> null
      - max_count                     = 4 -> null
      - max_pods                      = 30 -> null
      - min_count                     = 2 -> null
      - mode                          = "User" -> null
      - name                          = "msnode" -> null
      - node_count                    = 2 -> null
      - node_labels                   = {} -> null
      - node_public_ip_enabled        = false -> null
      - node_taints                   = [
          - "kubernetes.io/os=windows:NoSchedule",
        ] -> null
      - orchestrator_version          = "1.32" -> null
      - os_disk_size_gb               = 128 -> null
      - os_disk_type                  = "Ephemeral" -> null
      - os_sku                        = "Windows2019" -> null
      - os_type                       = "Windows" -> null
      - priority                      = "Regular" -> null
      - scale_down_mode               = "Delete" -> null
      - spot_max_price                = -1 -> null
      - tags                          = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "testing"
        } -> null
      - ultra_ssd_enabled             = false -> null
      - vm_size                       = "Standard_D4ds_v5" -> null
      - vnet_subnet_id                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-01" -> null
      - zones                         = [
          - "1",
        ] -> null
        # (6 unchanged attributes hidden)

      - timeouts {
          - update = "180m" -> null
        }

      - upgrade_settings {
          - drain_timeout_in_minutes      = 0 -> null
          - max_surge                     = "33%" -> null
          - node_soak_duration_in_minutes = 0 -> null
        }

      - windows_profile {
          - outbound_nat_enabled = true -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.disks_resource_group has been deleted
  - resource "azurerm_resource_group" "disks_resource_group" {
      - id         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/disks-test-rg" -> null
        name       = "disks-test-rg"
        tags       = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-sds-deploy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":712,"Program":"tfcmt","SHA1":"","Target":"482: Aks_test - DeployInfrastructure","Vars":{}} -->